In [3]:
import pandas as pd
from pandas.plotting import autocorrelation_plot
from pandas.plotting import scatter_matrix 
import seaborn as sns
import numpy as np
import datetime
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
full_df = pd.read_csv('bank_marketing.csv')
full_df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [15]:
#split full_df into train and test (80-20) 
print(len(full_df))
print(round(len(full_df)*.80))
# train 3617
print(round(len(full_df)*.20))
# test 904

4521
3617
904

In [17]:
train_df = full_df[0:3617]
test_df = full_df[3617:]
print(len(train_df))
print(len(test_df))

3617
904

In [19]:
full_df[['education','balance']].groupby(['education'], as_index=False).mean()

   education      balance
0    primary  1411.544248
1  secondary  1196.814397
2   tertiary  1775.423704
3    unknown  1701.245989

In [24]:
full_df[['job','balance']].groupby(['job'], as_index=False).sum().sort_values(by='balance',ascending=False)

              job  balance
4      management  1712154
1     blue-collar  1026563
9      technician  1022205
0          admin.   586380
5         retired   533414
7        services   460350
2    entrepreneur   276381
6   self-employed   254811
3       housemaid   233386
10     unemployed   139446
8         student   129681
11        unknown    57065

In [3]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
age          4521 non-null int64
job          4521 non-null object
marital      4521 non-null object
education    4521 non-null object
default      4521 non-null object
balance      4521 non-null int64
housing      4521 non-null object
loan         4521 non-null object
contact      4521 non-null object
day          4521 non-null int64
month        4521 non-null object
duration     4521 non-null int64
campaign     4521 non-null int64
pdays        4521 non-null int64
previous     4521 non-null int64
poutcome     4521 non-null object
y            4521 non-null object
dtypes: int64(7), object(10)
memory usage: 600.5+ KB

In [4]:
train_df.describe()

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [5]:
train_df.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64